:PROPERTIES:
:ID:       bf232544-a084-4b3e-8af0-e11e5f184667
:END:
#+TITLE: Homelab Bogo-Repo: Terraspace, Ansible, GCP, Packer, Guix, SOPS, K8S, Helm
#+DESCRIPTION:

Connecting the config & secrets management between my homelab and cloud accounts
has been a pain. Everything in here surrounds Terraspace somewhat, since it's a
larger nexus of config surfaces that connect different platforms/products. I
would like to minimize the sprawl of configuration across environments where
possible ... but there's just not a great way to get everything in one swoop

+ Sops is great for Helm ... I've heard, though I'm not sure that anything other
  than as-needed secrets generation when possible is "great"
+ But you run into some friction when using sops for Terraform & Ansible. Each
  has it's own cache/logs/etc to worry about.
+ Even though [[https://terraspace.cloud/docs/misc/multiple-providers][Terraspace: multi-provider projects not recommended]], I would still
  like to consider my config mgmt and processes with Terraspace as a kind of
  "middle ground." If using multiple clouds, I would likely have multiple projects.

Terraspace framework takes a different approach to project organization to the
Terragrunt's multi-environment approach. There would still be config namespace,
module, code organization issues, but for me Ruby brings a lot to the table
here.

** File Structure

The file structure looks like what's below. Some paths and filenames have been
changed to protect the innocent. Much of this will be getting changed anyways

#+begin_src sh :results output code :wrap example log
tree .. --prune -a \
     -P "*envrc*" -P "*gcprc*" \
     -P vars -P ".sops.yaml" -P "*.sops.yml" -P "*.vars.yml*" \
     -P .dir-locals.el -P "requirements*" -P "manifest.scm" \
     -P "docker-compose*yml" -P "*env*" -P Terrafile -P Gemfile \
     -I "platform" -I "collections" -I "google-cloud-sdk*" -I "bundle"

echo
#+end_src

#+RESULTS:
#+begin_example log
..
├── ansible-proj
│   ├── .dir-locals.el
│   ├── .envrc
│   ├── group_vars
│   │   └── all
│   │       └── foo.sops.yml
│   ├── manifest.scm
│   ├── requirements.txt
│   ├── requirements.yml
│   ├── roles
│   │   └── rwxd.subuid_subgid
│   │       └── requirements-dev.txt
│   ├── .sops.yml
│   ├── tmp
│   │   └── foo.sops.yml
│   └── vars
│       ├── nautobot-kharis.sops.yml
│       └── nautobot-kharis.vars.yml
├── services
│   ├── nautobot
│   │   └── compose
│   │       ├── docker-compose.eg.yml
│   │       ├── docker-compose.ldap.yml
│   │       ├── docker-compose.mysql.yml
│   │       ├── docker-compose.yml
│   │       ├── .envrc
│   │       ├── local.env
│   │       ├── local.env.example
│   │       ├── manifest.scm
│   │       ├── requirements.txt
│   │       ├── .sops.yml
│   │       └── vars
│   │           ├── nautobot-kharis.sops.yml
│   │           └── nautobot-kharis.vars.yml
│   └── stepca
│       ├── .envrc
│       ├── manifest.scm
│       ├── .sops.yml
│       └── yk.env
└── terraspace-proj
    ├── .envrc
    ├── .gcprc
    ├── Gemfile
    ├── manifest.scm
    ├── requirements.txt
    └── Terrafile

14 directories, 33 files

#+end_example

